# pandas:  
- Dataframe:  It is special object to store the data in tabular form(table)in (rows & col)

In [ ]:
# My_practice:

In [33]:
import numpy as np
import pandas as pd

In [32]:
# try to create a dataframe:

user_data = {
    
  
    "marksA":np.random.randint(1,100,5),
    "marksB":np.random.randint(50,100,5),
    "marksC":np.random.randint(1,100,5),
    
}

In [3]:
user_data

{'marksA': array([76, 74, 11, 61, 52]),
 'marksB': array([85, 99, 63, 71, 78]),
 'marksC': array([77,  6, 51,  1, 30])}

In [10]:
df = pd.DataFrame(user_data)
print(df)

   marksA  marksB  marksC
0      76      85      77
1      74      99       6
2      11      63      51
3      61      71       1
4      52      78      30

In [9]:
df.head(n=3)

   marksA  marksB  marksC
0       8      92      62
1      44      89      94
2      52      94      78

In [92]:
df.columns

Index(['marksA', 'marksB', 'marksC'], dtype='object')

In [97]:
df.to_csv('marks.csv')

In [6]:
#read the file:

my_data = pd.read_csv('marks.csv')
my_data = my_data.drop(columns='Unnamed: 0')      # Delete any col
my_data

   marksA  marksB  marksC
0      74      82      51
1      85      73      83
2      13      73      41
3      13      96      29
4      83      66      63

In [7]:
my_data.describe()

          marksA    marksB     marksC
count   5.000000   5.00000   5.000000
mean   53.600000  78.00000  53.400000
std    37.293431  11.55422  20.755722
min    13.000000  66.00000  29.000000
25%    13.000000  73.00000  41.000000
50%    74.000000  73.00000  51.000000
75%    83.000000  82.00000  63.000000
max    85.000000  96.00000  83.000000

In [11]:
df.tail()

   marksA  marksB  marksC
0      76      85      77
1      74      99       6
2      11      63      51
3      61      71       1
4      52      78      30

In [12]:
# To access a perticular Row: iloc[]

df.iloc[2]

marksA    11
marksB    63
marksC    51
Name: 2, dtype: int32

In [17]:
#Row and col:
print(type(df))
df.iloc[2,1]

<class 'pandas.core.frame.DataFrame'>

63

In [18]:
## Sort your dataframe:
df

   marksA  marksB  marksC
0      76      85      77
1      74      99       6
2      11      63      51
3      61      71       1
4      52      78      30

In [22]:
df.sort_values(by=['marksC','marksA'], ascending=True)

   marksA  marksB  marksC
3      61      71       1
1      74      99       6
4      52      78      30
2      11      63      51
0      76      85      77

In [23]:
print(type(df))
print(df.shape)

<class 'pandas.core.frame.DataFrame'>
(5, 3)

In [24]:
data_array = df.values

In [25]:
print(data_array)
print(type(data_array))

[[76 85 77]
 [74 99  6]
 [11 63 51]
 [61 71  1]
 [52 78 30]]
<class 'numpy.ndarray'>

In [35]:
# 2nd row nd 2nd col:

data_array[2] [2]

51

In [58]:
# Numpy array into a dataframe:

In [37]:
new_data = pd.DataFrame(data_array,dtype='int32', columns=['Phy','Chem',"math"])

In [38]:
new_data.to_csv('phy.csv')        #index=True

In [39]:
new_data

   Phy  Chem  math
0   76    85    77
1   74    99     6
2   11    63    51
3   61    71     1
4   52    78    30

In [40]:
pwd()   #present working directory.

'C:\\Users\\kunal\\PycharmProjects\\3RI_Data_Analytics\\Library\\Pandas_Tutorial'